<?php

namespace TextStyling;

class TextStyling {
    public static function convertToVaporwave($string) {
        $flipTable = array(
            '¡' => '！',
            '"' => '＂',
            '&' => '＆',
            "'" => '，',
            '(' => '）',
            ')' => '（',
            ',' =>  "＇",
            '.' => '．',
            '0' => '０',
            '1' => '１',
            '2' => '２',
            '3' => '３',
            '4' => '４',
            '5' => '５',
            '6' => '６',
            '7' => '７',
            '8' => '８',
            '9' => '９',
            '<' => '＜',
            '>' => '＞',
            '?' => '？',
            'A' => 'Ａ',
            'B' => 'Ｂ',
            'C' => 'Ｃ',
            'D' => 'Ｄ',
            'E' => 'Ｅ',
            'F' => 'Ｆ',
            'G' => 'Ｇ',
            'H' => 'Ｈ',
            'I' => 'Ｉ',
            'J' => 'Ｊ',
            'K' => 'Ｋ',
            'L' => 'Ｌ',
            'M' => 'Ｍ',
            'N' => 'Ｎ',
            'Ñ' => 'Ñ',
            'O' => 'Ｏ',
            'P' => 'Ｐ',
            'Q' => 'Ｑ',
            'R' => 'Ｒ',
            'S' => 'Ｓ',
            'T' => 'Ｔ',
            'U' => 'Ｕ',
            'V' => 'Ｖ',
            'W' => 'Ｗ',
            'X' => 'Ｘ',
            'Y' => 'Ｙ',
            'Z' => 'Ｚ',
            '[' => '［',
            ']' => '］',
            '_' => '＿',
            'a' => 'ａ',
            'b' => 'ｂ',
            'c' => 'ｃ',
            'd' => 'ｄ',
            'e' => 'ｅ',
            'f' => 'ｆ',
            'g' => 'ｇ',
            'h' => 'ｈ',
            'i' => 'ｉ',
            'j' => 'ｊ',
            'k' => 'ｋ',
            'l' => 'ｌ',
            'm' => 'ｍ',
            'n' => 'ｎ',
            'ñ' => 'ñ',
            'o' => 'ｏ',
            'p' => 'ｐ',
            'q' => 'ｑ',
            'r' => 'ｒ',
            's' => 'ｓ',
            't' => 'ｔ',
            'u' => 'ｕ',
            'v' => 'ｖ',
            'w' => 'ｗ',
            'x' => 'ｘ',
            'y' => 'ｙ',
            'z' => 'ｚ',
            '{' => '｛',
            '}' => '｝',
            ' ' => '　'
        );

        $newStr = '';
        for ($i = 0; $i < strlen($string); $i++) {
            $ch = $string[$i];
            if (array_key_exists($ch, $flipTable))
                $newStr .= $flipTable[$ch];
            else
                $newStr .= $ch;
        }
        return $newStr;
    }

    public static function convertUpsideDown($match)
    {
        $flipTable = array(
            '!' => '¡',
            '¡' => '!',
            '"' => ',,',
            '&' => '⅋',
            "'" => ',',
            '(' => ')',
            ')' => '(',
            ',' =>  "'",
            '.' => '˙',
            '0' => '0',
            '1' => 'Ɩ',
            '2' => 'ᄅ',
            '3' => 'Ɛ',
            '4' => 'ᔭ',
            '5' => 'ϛ',
            '6' => '9',
            '7' => 'ㄥ',
            '8' => '8',
            '9' => '6',
            '<' => '>',
            '>' => '<',
            '?' => '¿',
            'A' => 'ɐ',
            'B' => 'q',
            'C' => 'ɔ',
            'D' => 'p',
            'E' => 'ǝ',
            'F' => 'ɟ',
            'G' => 'ƃ',
            'H' => 'ɥ',
            'I' => 'ᴉ',
            'J' => 'ɾ',
            'K' => 'ʞ',
            'L' => 'l',
            'M' => 'ɯ',
            'N' => 'u',
            'Ñ' => 'ñ',
            'O' => 'o',
            'P' => 'd',
            'Q' => 'b',
            'R' => 'ɹ',
            'S' => 's',
            'T' => 'ʇ',
            'U' => 'n',
            'V' => 'ʌ',
            'W' => 'ʍ',
            'X' => 'x',
            'Y' => 'ʎ',
            'Z' => 'z',
            '[' => ']',
            ']' => '[',
            '_' => '‾',
            'a' => 'ɐ',
            'b' => 'q',
            'c' => 'ɔ',
            'd' => 'p',
            'e' => 'ǝ',
            'f' => 'ɟ',
            'g' => 'ƃ',
            'h' => 'ɥ',
            'i' => 'ᴉ',
            'j' => 'ɾ',
            'k' => 'ʞ',
            'l' => 'l',
            'm' => 'ɯ',
            'n' => 'u',
            'ñ' => 'ñ',
            'o' => 'o',
            'p' => 'd',
            'q' => 'b',
            'r' => 'ɹ',
            's' => 's',
            't' => 'ʇ',
            'u' => 'n',
            'v' => 'ʌ',
            'w' => 'ʍ',
            'x' => 'x',
            'y' => 'ʎ',
            'z' => 'z',
            '{' => '}',
            '}' => '{'
        );

        $origStr = strrev($match);
        $newStr = ' ';
        for ($i = 0; $i < strlen($origStr); $i++) {
            $ch = $origStr[$i];
            if (array_key_exists($ch, $flipTable))
                $newStr .= $flipTable[$ch];
            else
                $newStr .= $ch;
        }
        return $newStr;
    }
}